Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAB288.PIC
      <edc:SFRDef edc:_addr="0x1F8E8030" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRDLYCFG0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DDRDLYCFG0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W2RDLY" edc:desc="" edc:mask="0xf" edc:name="W2RDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="W2RCSDLY" edc:desc="" edc:mask="0xf" edc:name="W2RCSDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="R2RDLY" edc:desc="" edc:mask="0xf" edc:name="R2RDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="R2RCSDLY" edc:desc="" edc:mask="0xf" edc:name="R2RCSDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="W2WDLY" edc:desc="" edc:mask="0xf" edc:name="W2WDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="W2WCSDLY" edc:desc="" edc:mask="0xf" edc:name="W2WCSDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="R2WDLY" edc:desc="" edc:mask="0xf" edc:name="R2WDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RMWDLY" edc:desc="" edc:mask="0xf" edc:name="RMWDLY" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8034" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRDLYCFG1" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000000000000000000000000000" edc:name="DDRDLYCFG1" edc:nzwidth="32" edc:por="-0000000000000000000000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SLFREFMINDLY" edc:desc="" edc:mask="0xff" edc:name="SLFREFMINDLY" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="SLFREFEXDLY" edc:desc="" edc:mask="0xff" edc:name="SLFREFEXDLY" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="PWRDNMINDLY" edc:desc="" edc:mask="0xf" edc:name="PWRDNMINDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PWRDNEXDLY" edc:desc="" edc:mask="0x3f" edc:name="PWRDNEXDLY" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="W2PCHRGDLY4" edc:desc="" edc:mask="0x1" edc:name="W2PCHRGDLY4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="W2RDLY4" edc:desc="" edc:mask="0x1" edc:name="W2RDLY4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="W2RCSDLY4" edc:desc="" edc:mask="0x1" edc:name="W2RCSDLY4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NXTDATAVDLY4" edc:desc="" edc:mask="0x1" edc:name="NXTDATAVDLY4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLFREFEXDLY8" edc:desc="" edc:mask="0x1" edc:name="SLFREFEXDLY8" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8038" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn----nnnn" edc:cname="DDRDLYCFG2" edc:desc="" edc:impl="0xffffff0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000000000000----0000" edc:name="DDRDLYCFG2" edc:nzwidth="32" edc:por="000000000000000000000000----0000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PCHRGALLDLY" edc:desc="" edc:mask="0xf" edc:name="PCHRGALLDLY" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="R2PCHRGDLY" edc:desc="" edc:mask="0xf" edc:name="R2PCHRGDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="W2PCHRGDLY" edc:desc="" edc:mask="0xf" edc:name="W2PCHRGDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RAS2RASDLY" edc:desc="" edc:mask="0xf" edc:name="RAS2RASDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RAS2CASDLY" edc:desc="" edc:mask="0xf" edc:name="RAS2CASDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PCHRG2RASDLY" edc:desc="" edc:mask="0xf" edc:name="PCHRG2RASDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RBENDDLY" edc:desc="" edc:mask="0xf" edc:name="RBENDDLY" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E803C" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="----------nnnnnn--nnnnnn---nnnnn" edc:cname="DDRDLYCFG3" edc:desc="" edc:impl="0x3f3f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000--000000---00000" edc:name="DDRDLYCFG2" edc:nzwidth="32" edc:por="----------000000--000000---00000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RAS2PCHRGDLY" edc:desc="" edc:mask="0xf" edc:name="RAS2PCHRGDLY" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RAS2RASSBNKDLY" edc:desc="" edc:mask="0x3f" edc:name="RAS2RASSBNKDLY" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FAWTDLY" edc:desc="" edc:mask="0x3f" edc:name="FAWTDLY" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8040" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="---------nnn-nnnnnnnnnnnnnnnnnnn" edc:cname="DDRODTCFG" edc:desc="" edc:impl="0x77ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------000-0000000000000000000" edc:name="DDRODTCFG" edc:nzwidth="32" edc:por="---------000-0000000000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODTCSEN" edc:desc="" edc:mask="0xff" edc:name="ODTCSEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="ODTRDLY" edc:desc="" edc:mask="0xf" edc:name="ODTRDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="ODTWDLY" edc:desc="" edc:mask="0xf" edc:name="ODTWDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="ODTRLEN" edc:desc="" edc:mask="0x7" edc:name="ODTRLEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODTWLEN" edc:desc="" edc:mask="0x7" edc:name="ODTWLEN" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
